Repository: Pooh1017/todolist-app
Catalog: lib/l10n/app_*.arb
Languages: th

source: Settings
th: ตั้งค่า

source: Language
th: ภาษา

# settingsTitle
source: Settings
th: การตั้งค่า

# sectionCustomize
source: Customize
th: ปรับแต่ง

# sectionDateTime
source: Date & Time
th: วันที่ & เวลา

# sectionAbout
source: About
th: เกี่ยวกับ

source: Account
th: บัญชี

source: Theme
th: ธีม

# notificationsAndReminder
source: Notifications & Reminders
th: การแจ้งเตือน & เตือนความจำ

source: Date format
th: รูปแบบวันที่

source: Default reminder
th: ค่าเริ่มต้นการแจ้งเตือน

source: Share app
th: แบ่งปันแอพ

# rate5Stars
source: Rate stars
th: ให้ดาว

source: Contact us
th: ติดต่อเรา

source: Feedback
th: ความคิดเห็น

source: System
th: ตามระบบ

source: Light
th: สว่าง

source: Dark
th: มืด

# onText
source: On
th: เปิด

# offText
source: Off
th: ปิด

# dateFmtDmySlash
source: Day/Month/Year
th: วัน/เดือน/ปี

# dateFmtMdySlash
source: Month/Day/Year
th: เดือน/วัน/ปี

# dateFmtYmdDash
source: Year-Month-Day
th: ปี-เดือน-วัน

# dateFmtDmyDash
source: Day-Month-Year
th: วัน-เดือน-ปี

# versionLabel
source: Version: {v}
th: เวอร์ชัน: {v}

# minutes
source: {m} min
th: {m} นาที

# shareMessage
source: Try this To-Do app: {link}
th: ลองใช้แอพ To Do List: {link}

source: Log out
th: ออกจากระบบ

source: Cancel
th: ยกเลิก

source: Save
th: บันทึก

source: OK
th: ตกลง

source: Now
th: ตอนนี้

source: Send
th: ส่ง

source: Username
th: ชื่อผู้ใช้

source: Email
th: อีเมล

source: Signed in with
th: เข้าสู่ระบบด้วย

# notSetName
source: No name set
th: ยังไม่ได้ตั้งชื่อ

# logoutConfirmTitle
source: Log out?
th: ออกจากระบบ?

# logoutConfirmBody
source: Do you want to log out now?
th: คุณต้องการออกจากระบบตอนนี้หรือไม่?

# providerEmailPassword
source: Email / Password
th: อีเมล / รหัสผ่าน

# providerPhone
source: Phone number
th: เบอร์โทรศัพท์

# feedbackPrompt
source: Type your feedback
th: พิมพ์ความคิดเห็นของคุณ

# feedbackHint
source: Write a message...
th: เขียนข้อความ...

source: Feedback sent (example)
th: ส่งความคิดเห็นแล้ว (ตัวอย่าง)

source: Facebook Page
th: เพจ Facebook

# facebookPlaceholder
source: Add real link here
th: สามารถเพิ่มลิงก์จริงได้

# notificationsTitle
source: Notifications
th: การแจ้งเตือน

# notificationsEnableTitle
source: Enable notifications
th: เปิดการแจ้งเตือน

# notificationsEnableSubtitle
source: Remind before the scheduled time
th: แจ้งเตือนก่อนถึงเวลาที่ตั้งไว้

# rateThanksTitle
source: Thanks for your support!
th: ขอบคุณสำหรับการสนับสนุน!

# rateNoteSubtitle
source: In the next step, this can open the real Store page.
th: จะต่อไปหน้า Store จริงได้ในขั้นต่อไป

# goToStore
source: Open Store page
th: ไปที่หน้า Store

source: Go back
th: กลับไปก่อน

# rateSnackExample
source: Example: Open Store page
th: ตัวอย่าง: ไปหน้า Store

source: Remind before
th: เตือนล่วงหน้า

# themeApplyAllApp
source: Change the app theme
th: เปลี่ยนธีมทั้งแอพ

# themeChooseHint
source: Choose: Light / Dark
th: เลือกได้: สว่าง / มืด

# themeLightDesc
source: Bright background, easy to read
th: พื้นหลังสว่าง อ่านง่าย สบายตา

# themeDarkDesc
source: Modern dark look, easier on eyes at night
th: ดำอมฟ้า ดูทันสมัย ถนอมสายตากลางคืน

# themeNote
source: Note: The app will save your choice and apply it immediately.
th: หมายเหตุ: ระบบจะบันทึกค่าที่คุณเลือกไว้ และนำไปใช้ทันที

# drawerAppSubtitle
source: Manage your tasks easily
th: จัดการงานของคุณแบบง่าย ๆ

# drawerMenuSection
source: Menu
th: เมนู

# drawerTodo
source: To-do
th: สิ่งที่ต้องทำ

# drawerCategorySection
source: Categories
th: ประเภท

# drawerCategoriesTitle
source: Categories
th: ประเภท

# drawerCategoriesSubtitle
source: Choose a category to view
th: เลือกหมวดที่ต้องการดู

# drawerCatWork
source: Work
th: งาน

# drawerCatWorkSub
source: View all work tasks
th: ดูรายการงานทั้งหมด

# drawerCatTodo
source: To-do
th: สิ่งที่ต้องทำ

# drawerCatTodoSub
source: To-do and starred items
th: รายการที่ต้องทำและรายการสำคัญ

# drawerCatPlan
source: Planned
th: ที่วางแผนไว้

# drawerCatPlanSub
source: Scheduled / planned tasks
th: งานที่นัดหมาย/วางแผนไว้

# drawerCatImportant
source: Due soon
th: ใกล้ครบกำหนด

# drawerCatImportantSub
source: Upcoming deadlines / urgent tasks
th: งานที่ใกล้ถึงกำหนด/ต้องรีบทำ

# calendarTitle
source: Calendar
th: ปฏิทิน

# calendarItemsTitle
source: Items on {date}
th: รายการ {date}

# calendarEmptyHint
source: No items today. Tap + to add one.
th: ไม่มีรายการในวันนี้ กด + เพื่อเพิ่ม

# addItemTitle
source: Add item
th: เพิ่มรายการ

# typeItemHint
source: Type an item...
th: พิมพ์รายการ...

# selectedDayLabel
source: Selected day
th: วันเลือก

# setTimeLabel
source: Set time
th: ใส่เวลา

# timeInputTitle
source: Enter time
th: ใส่เวลา

# timeInputHint
source: HH:mm e.g. 09:30
th: HH:mm เช่น 09:30

# timeInputInvalid
source: Please enter time as HH:mm (e.g. 09:30, 18:05)
th: กรุณาใส่เวลาเป็น HH:mm (เช่น 09:30, 18:05)

# searchTitle
source: Search
th: ค้นหา

# searchHint
source: Search by title or category...
th: ค้นหาจากชื่อหรือหมวด...

# searchEmpty
source: No results
th: ไม่พบรายการ

# todoAllTitle
source: To-do (Starred included)
th: สิ่งที่ต้องทำ (รวมดาว)

# categoryEmptyHint
source: No items in this category. Tap + to add.
th: ยังไม่มีรายการในหมวดนี้ กด + เพื่อเพิ่ม

# addInCategoryTitle
source: Add to “{category}”
th: เพิ่มในหมวด “{category}”

source: Pick date
th: เลือกวันที่

source: Pick time
th: ใส่เวลา

# timeInvalidHint
source: Please enter time in HH:mm (e.g. 09:30, 18:05)
th: กรุณาใส่เวลาเป็น HH:mm (เช่น 09:30, 18:05)

# homeToday
source: Today
th: วันนี้

# homeFuture
source: Upcoming
th: งานถัดไป

# homeOverdue
source: Overdue
th: เลยกำหนด

# homeDone
source: Completed
th: เสร็จแล้ว

# emptyHome
source: No tasks yet. Tap + to add one.
th: ยังไม่มีรายการ กด + เพื่อเพิ่มงาน

# emptyToday
source: No tasks for today
th: ยังไม่มีงานวันนี้

# emptyFuture
source: No upcoming tasks
th: ยังไม่มีงานถัดไป

# emptyOverdue
source: No overdue tasks
th: ยังไม่มีงานเลยกำหนด

# emptyDone
source: No completed tasks
th: ยังไม่มีงานที่เสร็จแล้ว

# addTaskTitle
source: Add task
th: เพิ่มรายการ

# addTaskHint
source: Type your task...
th: พิมพ์สิ่งที่ต้องทำ...

# dueLabel
source: Due: {dt}
th: กำหนด: {dt}

source: Choose date
th: เลือกวันที่

source: Enter time
th: ใส่เวลา

# nearDueAllTitle
source: Due soon
th: ใกล้ครบกำหนด

# nearDueAllEmpty
source: No tasks due soon
th: ยังไม่มีงานที่ใกล้ครบกำหนด

# itemsCount
source: {n} items
th: {n} รายการ

# overviewTitle
source: Overview
th: ภาพรวม

# overviewDoneCard
source: Completed tasks
th: งานที่เสร็จสมบูรณ์

# overviewPendingCard
source: Pending tasks
th: งานที่รอดำเนินการ

# overviewPieTitle
source: Task distribution
th: สัดส่วนงานทั้งหมด

# overviewEmptyAll
source: No tasks yet
th: ยังไม่มีงานในระบบ

# overviewNext30Title
source: Tasks in 30 days
th: งานใน 30 วัน

# overviewNext30Empty
source: No tasks in 30 days
th: ไม่มีงานใน 30 วัน

# overviewCountLabel
source: Tasks
th: จำนวนงาน

# statusDone
source: Completed
th: เสร็จแล้ว

# statusOverdue
source: Overdue
th: เลยกำหนด

# statusInProgress
source: In progress
th: รอดำเนินการ

# statusNearDue
source: Due soon
th: ใกล้ครบกำหนด

# addItemHint
source: Type an item...
th: พิมพ์รายการ...

# nowText
source: Now
th: ตอนนี้

# okText
source: OK
th: ตกลง

source: Due date
th: วันที่ครบกำหนด

# timeAndReminder
source: Time & reminder
th: เวลา & แจ้งเตือน

source: Remind at
th: การแจ้งเตือนที่

source: Reminder type
th: ประเภทการแจ้งเตือน

source: Note
th: หมายเหตุ

source: Add subtask
th: เพิ่มงานย่อย

# addSubtaskTitle
source: Add subtask
th: เพิ่มงานย่อย

# addSubtaskHint
source: Type subtask...
th: พิมพ์งานย่อย...

# addText
source: Add
th: เพิ่ม

source: Close
th: ปิด

# deleteTaskTitle
source: Delete this task?
th: ลบรายการนี้?

# deleteTaskBody
source: This cannot be undone.
th: การลบจะไม่สามารถกู้คืนได้

source: Delete
th: ลบ

source: Duplicate
th: สร้างสำเนา

# duplicatedSnack
source: Duplicated
th: สร้างสำเนาแล้ว

source: Completed
th: เสร็จแล้ว

source: Not done
th: ยังไม่เสร็จ

# remindOnTime
source: On time
th: ตรงเวลา

# remindMinutesBefore
source: {m} min before
th: {m} นาที ก่อน

# remindHoursBefore
source: {h} hr before
th: {h} ชม. ก่อน

# remindDaysBefore
source: {d} day before
th: {d} วัน ก่อน

# remindTypeNotify
source: Notification
th: การแจ้งเตือน

# remindTypeSound
source: Sound
th: เสียง

# remindTypeVibrate
source: Vibrate
th: สั่น
